generate/openfoam/taylor_green/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

// Domain: [0, 2*pi] x [0, 2*pi]
pi  3.14159265359;

vertices
(
    (0        0        0)    // 0
    (#calc "2*$pi"  0        0)    // 1
    (#calc "2*$pi"  #calc "2*$pi"  0)    // 2
    (0        #calc "2*$pi"  0)    // 3
    (0        0        0.1)  // 4
    (#calc "2*$pi"  0        0.1)  // 5
    (#calc "2*$pi"  #calc "2*$pi"  0.1)  // 6
    (0        #calc "2*$pi"  0.1)  // 7
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (64 64 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    left
    {
        type cyclic;
        neighbourPatch right;
        faces
        (
            (0 4 7 3)
        );
    }

    right
    {
        type cyclic;
        neighbourPatch left;
        faces
        (
            (1 2 6 5)
        );
    }

    bottom
    {
        type cyclic;
        neighbourPatch top;
        faces
        (
            (0 1 5 4)
        );
    }

    top
    {
        type cyclic;
        neighbourPatch bottom;
        faces
        (
            (3 7 6 2)
        );
    }

    frontAndBack
    {
        type empty;
        faces
        (
            (0 3 2 1)
            (4 5 6 7)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
