generate/openfoam/taylor_green/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2412                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
FoamFile
{
    version         2;
    format          ascii;
    class           volVectorField;
    object          U;
}

dimensions      [ 0 1 -1 0 0 0 0 ];

internalField   #codeStream
{
    codeInclude
    #{
        #include "fvCFD.H"
    #};

    codeOptions
    #{
        -I$(LIB_SRC)/finiteVolume/lnInclude \
        -I$(LIB_SRC)/meshTools/lnInclude
    #};

    codeLibs
    #{
        -lmeshTools \
        -lfiniteVolume
    #};

    code
    #{
        const IOdictionary& d = static_cast<const IOdictionary&>(dict);
        const fvMesh& mesh = refCast<const fvMesh>(d.db());
        vectorField U(mesh.nCells());

        const scalar U0 = 1.0; // Characteristic velocity

        forAll(U, i)
        {
            const vector& c = mesh.C()[i];
            scalar x = c.x();
            scalar y = c.y();

            U[i] = vector(
                -U0 * cos(x) * sin(y),     // u-component
                +U0 * sin(x) * cos(y),    // v-component
                0.0                       // w-component
            );
        }

        U.writeEntry("", os);
    #};
};

boundaryField
{
    top
    {
        type            cyclic;
    }
    right
    {
        type            cyclic;
    }
    bottom
    {
        type            cyclic;
    }
    left
    {
        type            cyclic;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
