generate/openfoam/taylor_green/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   #codeStream
{
    codeInclude
    #{
        #include "fvCFD.H"
    #};

    codeOptions
    #{
        -I$(LIB_SRC)/finiteVolume/lnInclude \
        -I$(LIB_SRC)/meshTools/lnInclude
    #};

    codeLibs
    #{
        -lmeshTools \
        -lfiniteVolume
    #};

    code
    #{
        const IOdictionary& d = static_cast<const IOdictionary&>(dict);
        const fvMesh& mesh = refCast<const fvMesh>(d.db());
        scalarField p(mesh.nCells());

        const scalar U0 = 1.0;      // Characteristic velocity
        const scalar rho = 1.0;     // Density
        const scalar p0 = 0.0;      // Reference pressure

        forAll(p, i)
        {
            const vector& c = mesh.C()[i];
            scalar x = c.x();
            scalar y = c.y();

            p[i] = p0 - (rho * U0 * U0 / 4.0) * (cos(2.0*x) + cos(2.0*y));
        }

        p.writeEntry("", os);
    #};
};

boundaryField
{
    left
    {
        type            cyclic;
    }

    right
    {
        type            cyclic;
    }

    bottom
    {
        type            cyclic;
    }

    top
    {
        type            cyclic;
    }

    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
